RT-Thread/rt-thread/bsp/stm32/libraries/STM32WLxx_HAL/STM32WLxx_HAL_Driver/Inc/stm32wlxx_hal_pwr_ex.h
/** @defgroup PWR_EC_EOL_OPERATING_MODES Monitoring of supply voltage for radio operating level (radio End Of Life)
  * @{
  */
#define PWR_RADIO_EOL_DISABLE               (0x00000000UL)    /*!< Monitoring of supply voltage for radio operating level (radio End Of Life) disable */
#define PWR_RADIO_EOL_ENABLE                (PWR_CR5_RFEOLEN) /*!< Monitoring of supply voltage for radio operating level (radio End Of Life) enable */
/**
  * @}
  */

/** @defgroup PWR_EC_SMPS_OPERATING_MODES SMPS Step down converter operating modes
  * @{
  */
#define PWR_SMPS_BYPASS                     (0x00000000UL)    /*!< SMPS step down in bypass mode  */
#define PWR_SMPS_STEP_DOWN                  (PWR_CR5_SMPSEN)  /*!< SMPS step down in step down mode if system low power mode is run, LP run or stop0. If system low power mode is stop1, stop2, standby, shutdown, then SMPS is forced in mode open to preserve energy stored in decoupling capacitor as long as possible. Note: In case of a board without SMPS coil mounted, SMPS should not be activated. */
/**
  * @}
  */

/** @defgroup PWR_EC_RADIO_BUSY_POLARITY Radio busy signal polarity
  * @{
  */
#define PWR_RADIO_BUSY_POLARITY_RISING      (0x00000000UL)     /*!< Radio busy signal polarity to rising edge (detection on high level). */
#define PWR_RADIO_BUSY_POLARITY_FALLING     (PWR_CR4_WRFBUSYP) /*!< Radio busy signal polarity to falling edge (detection on low level). */
/**
  * @}
  */

/** @defgroup PWR_EC_RADIO_BUSY_TRIGGER Radio busy trigger
  * @{
  */
#define PWR_RADIO_BUSY_TRIGGER_NONE         (0x00000000UL)     /*!< Radio busy trigger action: no wake-up from low-power mode and no interruption sent to the selected CPU. */
#define PWR_RADIO_BUSY_TRIGGER_WU_IT        (PWR_CR3_EWRFBUSY) /*!< Radio busy trigger action: wake-up from low-power mode Standby and interruption sent to the selected CPU. */
/**
  * @}
  */

/** @defgroup PWR_EC_RADIO_IRQ_TRIGGER Radio IRQ trigger
  * @{
  */
#define PWR_RADIO_IRQ_TRIGGER_NONE          (0x00000000UL)     /*!< Radio IRQ trigger action: no wake-up from low-power mode and no interruption sent to the selected CPU. */
#define PWR_RADIO_IRQ_TRIGGER_WU_IT         (PWR_CR3_EWRFIRQ)  /*!< Radio IRQ trigger action: wake-up from low-power mode Standby and interruption sent to the selected CPU. */
/**
  * @}
  */

/** @defgroup PWREx_Flag  PWR Status Flags
  *        Elements values convention: 0000 0000 0XXY YYYYb
  *           - Y YYYY  : Flag position in the XX register (5 bits)
  *           - XX  : Status register (2 bits)
  *                 - 01: SR1 register
  *                 - 10: SR2 register
  *                 - 11: EXTSCR register
  * @{
  */
/*--------------------------------SR1-------------------------------*/
#define PWR_FLAG_WUF1                       (PWR_SR1_WUF1_Pos | PWR_FLAG_REG_SR1)        /*!< Wakeup event on wakeup pin 1 */
#define PWR_FLAG_WUF2                       (PWR_SR1_WUF2_Pos | PWR_FLAG_REG_SR1)        /*!< Wakeup event on wakeup pin 2 */
#define PWR_FLAG_WUF3                       (PWR_SR1_WUF3_Pos | PWR_FLAG_REG_SR1)        /*!< Wakeup event on wakeup pin 3 */
#define PWR_FLAG_WU                         (PWR_SR1_WUF | PWR_FLAG_REG_SR1)             /*!< Encompass wakeup event on all wakeup pins */
#define PWR_FLAG_WPVD                       (PWR_SR1_WPVDF_Pos | PWR_FLAG_REG_SR1)       /*!< Wakeup PVD flag */
#define PWR_FLAG_HOLDC2I                    (PWR_SR1_C2HF_Pos | PWR_FLAG_REG_SR1)        /*!< CPU2 on-Hold Interrupt Flag */
#define PWR_FLAG_WUFI                       (PWR_SR1_WUFI_Pos | PWR_FLAG_REG_SR1)        /*!< Wakeup on internal wakeup line */
#define PWR_FLAG_WRFBUSY                    (PWR_SR1_WRFBUSYF_Pos | PWR_FLAG_REG_SR1)    /*!< Wakeup radio busy flag (triggered status: wake-up event or interruption occurred at least once. Can be cleared by software) */
/*--------------------------------SR2-------------------------------*/
#define PWR_FLAG_LDORDY                     (PWR_SR2_LDORDY_Pos | PWR_FLAG_REG_SR2)      /*!< Main LDO ready flag */
#define PWR_FLAG_SMPSRDY                    (PWR_SR2_SMPSRDY_Pos | PWR_FLAG_REG_SR2)     /*!< SMPS ready Flag */
#define PWR_FLAG_REGLPS                     (PWR_SR2_REGLPS_Pos | PWR_FLAG_REG_SR2)      /*!< Low-power regulator started and ready flag */
#define PWR_FLAG_REGLPF                     (PWR_SR2_REGLPF_Pos | PWR_FLAG_REG_SR2)      /*!< Low-power regulator (main regulator or low-power regulator used) flag */
#define PWR_FLAG_REGMRS                     (PWR_SR2_REGMRS_Pos | PWR_FLAG_REG_SR2)      /*!< Main regulator supply from LDO or SMPS or directly from VDD */
#define PWR_FLAG_FLASHRDY                   (PWR_SR2_FLASHRDY_Pos | PWR_FLAG_REG_SR2)    /*!< Flash ready flag */
#define PWR_FLAG_VOSF                       (PWR_SR2_VOSF_Pos | PWR_FLAG_REG_SR2)        /*!< Voltage scaling flag */
#define PWR_FLAG_PVDO                       (PWR_SR2_PVDO_Pos | PWR_FLAG_REG_SR2)        /*!< Power Voltage Detector output flag */
#define PWR_FLAG_PVMO3                      (PWR_SR2_PVMO3_Pos | PWR_FLAG_REG_SR2)       /*!< Power Voltage Monitoring 3 output flag */
#define PWR_FLAG_RFEOL                      (PWR_SR2_RFEOLF_Pos | PWR_FLAG_REG_SR2)      /*!< Power Voltage Monitoring Radio end of life flag */
#define PWR_FLAG_RFBUSYS                    (PWR_SR2_RFBUSYS_Pos | PWR_FLAG_REG_SR2)     /*!< Radio busy signal flag (current status) */
#define PWR_FLAG_RFBUSYMS                   (PWR_SR2_RFBUSYMS_Pos | PWR_FLAG_REG_SR2)    /*!< Radio busy masked signal flag (current status) */
#define PWR_FLAG_C2BOOTS                    (PWR_SR2_C2BOOTS_Pos | PWR_FLAG_REG_SR2)     /*!< CPU2 boot request source information flag */
/*------------------------------EXTSCR------------------------------*/
#define PWR_FLAG_SB                         (PWR_EXTSCR_C1SBF_Pos | PWR_FLAG_REG_EXTSCR)    /*!< System Standby flag for CPU1 */
#define PWR_FLAG_STOP2                      (PWR_EXTSCR_C1STOP2F_Pos | PWR_FLAG_REG_EXTSCR) /*!< System Stop 2 flag for CPU1 */
#define PWR_FLAG_STOP                       (PWR_EXTSCR_C1STOPF_Pos | PWR_FLAG_REG_EXTSCR)  /*!< System Stop 0 or Stop 1 flag for CPU1 */
#if defined(DUAL_CORE)
#define PWR_FLAG_C2SB                       (PWR_EXTSCR_C2SBF_Pos | PWR_FLAG_REG_EXTSCR)    /*!< System Standby flag for CPU2 */
#define PWR_FLAG_C2STOP2                    (PWR_EXTSCR_C2STOP2F_Pos | PWR_FLAG_REG_EXTSCR) /*!< System Stop 2 flag for CPU2 */
#define PWR_FLAG_C2STOP                     (PWR_EXTSCR_C2STOPF_Pos | PWR_FLAG_REG_EXTSCR)  /*!< System Stop 0 or Stop 1 flag for CPU2 */
#endif

#define PWR_FLAG_LPMODES                    (PWR_FLAG_SB)                       /*!< System flag encompassing all low-powers flags (Stop0, 1, 2 and Standby) for CPU1, used when clearing flags */
#if defined(DUAL_CORE)
#define PWR_FLAG_C2LPMODES                  (PWR_FLAG_C2SB)                     /*!< System flag encompassing all low-powers flags (Stop0, 1, 2 and Standby) for CPU2, used when clearing flags */
#endif

#define PWR_FLAG_C1DEEPSLEEP                (PWR_EXTSCR_C1DS_Pos | PWR_FLAG_REG_EXTSCR)     /*!< CPU1 DeepSleep Flag */
#if defined(DUAL_CORE)
#define PWR_FLAG_C2DEEPSLEEP                (PWR_EXTSCR_C2DS_Pos | PWR_FLAG_REG_EXTSCR)     /*!< CPU2 DeepSleep Flag */
#endif
/**
  * @}
  */

